Revit 2027 API
IRebarUpdateServer.GetCustomHandleName Method
 This function should return the name of the handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool GetCustomHandleName(
	RebarHandleNameData handleNameData
)
Function GetCustomHandleName (
	handleNameData As RebarHandleNameData
) As Boolean
bool GetCustomHandleName(
	RebarHandleNameData^ handleNameData
)
abstract GetCustomHandleName :
        handleNameData : RebarHandleNameData -> bool
Parameters
handleNameData RebarHandleNameData
 The class used to output the rebarHandle name.
Return Value
Boolean
 Returns true if the handle name is defined successfully, false otherwise.
Remarks
 This function is called during edit constraints command when the mouse is over a handle or the funtion RebarConstrainedHandle.GetCustomHandleName() is called.
See Also
Reference
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace